In [1]:
import pandas as pd

In [16]:
df=pd.read_csv("countries.csv")

In [17]:
df.head()

       country  year  population
0  Afghanistan   NaN     8425333
1  Afghanistan   NaN     9240934
2  Afghanistan   NaN    10267083
3  Afghanistan   NaN    11537966
4  Afghanistan   NaN    13079460

In [5]:
df.shape

(1704, 3)

In [6]:
df.describe()

             year    population
count  1704.00000  1.704000e+03
mean   1979.50000  2.960121e+07
std      17.26533  1.061579e+08
min    1952.00000  6.001100e+04
25%    1965.75000  2.793664e+06
50%    1979.50000  7.023596e+06
75%    1993.25000  1.958522e+07
max    2007.00000  1.318683e+09

In [12]:
df1=df['country']

In [15]:
df1.dtypes

dtype('O')

In [19]:
df.dtypes=='object'

country        True
year          False
population    False
dtype: bool

In [26]:
df.dtypes!='object'

country       False
year           True
population     True
dtype: bool

In [27]:
df['year'].isnull()

0        True
1        True
2        True
3        True
4        True
        ...
1699    False
1700    False
1701    False
1702    False
1703    False
Name: year, Length: 1704, dtype: bool

In [28]:
df.shape

(1704, 3)

In [30]:
dfdel=df.dropna()

In [31]:
dfdel.shape

(1699, 3)

In [33]:
dfdel.head()

       country    year  population
5  Afghanistan  1977.0    14880372
6  Afghanistan  1982.0    12881816
7  Afghanistan  1987.0    13867957
8  Afghanistan  1992.0    16317921
9  Afghanistan  1997.0    22227415